{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Notebook disponível de forma interativa no [Binder](https://mybinder.org/v2/gh/QApedia/QApedia/master?filepath=examples)."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [],
   "source": [
    "# Carregando os módulos io, generator e utils do QApedia\n",
    "from QApedia import io\n",
    "from QApedia import generator\n",
    "from QApedia import utils\n",
    "\n",
    "# bibliotecas auxiliares\n",
    "import pandas as pd\n",
    "import csv"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [],
   "source": [
    "# Definir largura das colunas do dataframe para melhor visualização\n",
    "pd.set_option('max_colwidth', 800)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Definindo um template para geração de pares questão-sparql\n",
    "\n",
    "Com o objetivo de gerar um dataset com mais amostras, pode-se realizar a definição de um conjunto menor de templates representando o formato das questões e suas respectivas consultas SPARQL. Um template de geração possui quatro campos:\n",
    "\n",
    "1. Pergunta em linguagem natural.\n",
    "    * Deve possuir lacunas de forma a manter a pergunta mais generalista possível. \n",
    "        * Por exemplo: **``<A>`` escreveu ``<B>``?**, gera:\n",
    "            1. ``J. K. Rowling`` escreveu ``Harry Potter?``\n",
    "            2. ``J. R. R. Tolkien`` escreveu ``Hobbit?``\n",
    "2. Consulta SPARQL que deve responder a pergunta em linguagem natural.\n",
    "    * Deve conter as mesmas lacunas presentes na pergunta.\n",
    "    * A pseudo-query abaixo pode ser definida para a pergunta presente em 1.\n",
    "        1. ASK where {``<B>`` escrito_por ``<A>``}\n",
    "3. A SPARQL geradora deve ser capaz de recuperar as variáveis que possam preencher as lacunas\n",
    "    * pseudo-query que retorna todos os ?a que foram escritos por ?b.\n",
    "    ```\n",
    "      select ?a ?b where {?b escrito_por ?a}\n",
    "    ```\n",
    "    * ?a e ?b são equivalentes as lacunas ``<A>`` e ``<B>``.\n",
    "\n",
    "4. As variáveis da SPARQL geradora são no formato ?a ?b .. ?y ?z e correspondem as lacunas $<$A$>$ $<$B$>$ ... $<$Y$>$ $<$Z$>$ presentes na pergunta e na consulta.\n",
    "\n",
    "Dessa forma, o template que constrói o conjunto de perguntas que verifica se \"A é o autor de B?\" pode ser definido assim:\n",
    "\n",
    "```\n",
    "question: <A> escreveu <B>?\n",
    "query:  ASK where {<B> escrito_por <A>}\n",
    "generator_query: select ?a ?b where {?b escrito_por ?a}\n",
    "variables: [a, b]\n",
    "```\n",
    "\n",
    "A SPARQL geradora sempre é do tipo select, já que esta visa recuperar informações que serão utilizadas para preencher os campos das lacunas.\n",
    "\n",
    "## QApedia - Formato do template\n",
    "\n",
    "No QApedia o formato do template é um dicionário, no exemplo anterior, no python ficaria assim:\n",
    "\n",
    "```python\n",
    "template = {\"question\": \"<A> escreveu <B>?\",\n",
    "            \"query\": \"ASK where {<B> escrito_por <A>}\",\n",
    "            \"generator_query\": \"select ?a ?b where {?b escrito_por ?a}\",\n",
    "            \"variables\": [\"a\", \"b\"]}\n",
    "```\n",
    "\n",
    "Dado um template, a geração dos pares questão-sparql pode ser realizada através da função ``build_pairs_from_template`` presente no [módulo generator](https://qapedia.readthedocs.io/pt/latest/QApedia.html#module-QApedia.generator) do **QApedia**.\n",
    "\n",
    "a) Exemplo: Construindo pares de questão-sparql para o tipo de pergunta: $<$A$>$ foi um anime baseado em mangá?"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "100"
      ]
     },
     "execution_count": 3,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "template = {\"question\": \"<A> foi um anime baseado em mangá?\",\n",
    "            \"query\": \"ASK where {<A> dct:subject dbc:Anime_series_based_on_manga}\",\n",
    "            \"generator_query\": \"select ?a where {?a dbo:type dbr:Manga . ?a dct:subject dbc:Anime_series_based_on_manga}\",\n",
    "            \"variables\": [\"a\"]}\n",
    "\n",
    "pairs = generator.build_pairs_from_template(template)\n",
    "len(pairs)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Foram geradas 100 pares de questão-sparql, abaixo é mostrada uma tabela contendo esses pares gerados."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>question</th>\n",
       "      <th>sparql</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Akame ga Kill! foi um anime baseado em mangá?</td>\n",
       "      <td>ASK where {&lt;http://dbpedia.org/resource/Akame_ga_Kill!&gt; dct:subject dbc:Anime_series_based_on_manga}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Nisekoi foi um anime baseado em mangá?</td>\n",
       "      <td>ASK where {&lt;http://dbpedia.org/resource/Nisekoi&gt; dct:subject dbc:Anime_series_based_on_manga}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Crayon Shin-chan foi um anime baseado em mangá?</td>\n",
       "      <td>ASK where {&lt;http://dbpedia.org/resource/Crayon_Shin-chan&gt; dct:subject dbc:Anime_series_based_on_manga}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Kuroko no Basket foi um anime baseado em mangá?</td>\n",
       "      <td>ASK where {&lt;http://dbpedia.org/resource/Kuroko's_Basketball&gt; dct:subject dbc:Anime_series_based_on_manga}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Kochira Katsushika-ku Kameari Kōen-mae Hashutsujo foi um anime baseado em mangá?</td>\n",
       "      <td>ASK where {&lt;http://dbpedia.org/resource/Kochira_Katsushika-ku_Kameari_Kōen-mae_Hashutsujo&gt; dct:subject dbc:Anime_series_based_on_manga}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>Atashin'chi foi um anime baseado em mangá?</td>\n",
       "      <td>ASK where {&lt;http://dbpedia.org/resource/Atashin'chi&gt; dct:subject dbc:Anime_series_based_on_manga}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>Akatsuki no Yona foi um anime baseado em mangá?</td>\n",
       "      <td>ASK where {&lt;http://dbpedia.org/resource/Yona_of_the_Dawn&gt; dct:subject dbc:Anime_series_based_on_manga}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>Gakuen Alice foi um anime baseado em mangá?</td>\n",
       "      <td>ASK where {&lt;http://dbpedia.org/resource/Gakuen_Alice&gt; dct:subject dbc:Anime_series_based_on_manga}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>A Channel foi um anime baseado em mangá?</td>\n",
       "      <td>ASK where {&lt;http://dbpedia.org/resource/A_Channel_(manga)&gt; dct:subject dbc:Anime_series_based_on_manga}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>Seitokai Yakuindomo foi um anime baseado em mangá?</td>\n",
       "      <td>ASK where {&lt;http://dbpedia.org/resource/Seitokai_Yakuindomo&gt; dct:subject dbc:Anime_series_based_on_manga}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10</th>\n",
       "      <td>Strange+ foi um anime baseado em mangá?</td>\n",
       "      <td>ASK where {&lt;http://dbpedia.org/resource/Strange+&gt; dct:subject dbc:Anime_series_based_on_manga}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11</th>\n",
       "      <td>009-1 foi um anime baseado em mangá?</td>\n",
       "      <td>ASK where {&lt;http://dbpedia.org/resource/009-1&gt; dct:subject dbc:Anime_series_based_on_manga}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>12</th>\n",
       "      <td>Eyeshield 21 foi um anime baseado em mangá?</td>\n",
       "      <td>ASK where {&lt;http://dbpedia.org/resource/Eyeshield_21&gt; dct:subject dbc:Anime_series_based_on_manga}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>13</th>\n",
       "      <td>Unhappy foi um anime baseado em mangá?</td>\n",
       "      <td>ASK where {&lt;http://dbpedia.org/resource/Anne_Happy&gt; dct:subject dbc:Anime_series_based_on_manga}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>14</th>\n",
       "      <td>Aishiteruze Baby foi um anime baseado em mangá?</td>\n",
       "      <td>ASK where {&lt;http://dbpedia.org/resource/Aishiteruze_Baby&gt; dct:subject dbc:Anime_series_based_on_manga}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>15</th>\n",
       "      <td>Shingeki no Kyojin foi um anime baseado em mangá?</td>\n",
       "      <td>ASK where {&lt;http://dbpedia.org/resource/Attack_on_Titan&gt; dct:subject dbc:Anime_series_based_on_manga}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>16</th>\n",
       "      <td>Hunter × Hunter foi um anime baseado em mangá?</td>\n",
       "      <td>ASK where {&lt;http://dbpedia.org/resource/Hunter_×_Hunter&gt; dct:subject dbc:Anime_series_based_on_manga}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>17</th>\n",
       "      <td>Blood Lad foi um anime baseado em mangá?</td>\n",
       "      <td>ASK where {&lt;http://dbpedia.org/resource/Blood_Lad&gt; dct:subject dbc:Anime_series_based_on_manga}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>18</th>\n",
       "      <td>Attacker You! foi um anime baseado em mangá?</td>\n",
       "      <td>ASK where {&lt;http://dbpedia.org/resource/Attacker_You!&gt; dct:subject dbc:Anime_series_based_on_manga}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>19</th>\n",
       "      <td>Ao Haru Ride foi um anime baseado em mangá?</td>\n",
       "      <td>ASK where {&lt;http://dbpedia.org/resource/Blue_Spring_Ride&gt; dct:subject dbc:Anime_series_based_on_manga}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>20</th>\n",
       "      <td>Usagi Drop foi um anime baseado em mangá?</td>\n",
       "      <td>ASK where {&lt;http://dbpedia.org/resource/Bunny_Drop&gt; dct:subject dbc:Anime_series_based_on_manga}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>21</th>\n",
       "      <td>Aria (mangá) foi um anime baseado em mangá?</td>\n",
       "      <td>ASK where {&lt;http://dbpedia.org/resource/Aria_(manga)&gt; dct:subject dbc:Anime_series_based_on_manga}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>22</th>\n",
       "      <td>Claymore (mangá) foi um anime baseado em mangá?</td>\n",
       "      <td>ASK where {&lt;http://dbpedia.org/resource/Claymore_(manga)&gt; dct:subject dbc:Anime_series_based_on_manga}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>23</th>\n",
       "      <td>Hajime no Ippo foi um anime baseado em mangá?</td>\n",
       "      <td>ASK where {&lt;http://dbpedia.org/resource/Hajime_no_Ippo&gt; dct:subject dbc:Anime_series_based_on_manga}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>24</th>\n",
       "      <td>Blade of the Immortal foi um anime baseado em mangá?</td>\n",
       "      <td>ASK where {&lt;http://dbpedia.org/resource/Blade_of_the_Immortal&gt; dct:subject dbc:Anime_series_based_on_manga}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>25</th>\n",
       "      <td>The Knight in the Area foi um anime baseado em mangá?</td>\n",
       "      <td>ASK where {&lt;http://dbpedia.org/resource/The_Knight_in_the_Area&gt; dct:subject dbc:Anime_series_based_on_manga}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>26</th>\n",
       "      <td>Kuma Miko foi um anime baseado em mangá?</td>\n",
       "      <td>ASK where {&lt;http://dbpedia.org/resource/Kuma_Miko:_Girl_Meets_Bear&gt; dct:subject dbc:Anime_series_based_on_manga}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>27</th>\n",
       "      <td>Law of Ueki foi um anime baseado em mangá?</td>\n",
       "      <td>ASK where {&lt;http://dbpedia.org/resource/The_Law_of_Ueki&gt; dct:subject dbc:Anime_series_based_on_manga}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>28</th>\n",
       "      <td>Zatch Bell! foi um anime baseado em mangá?</td>\n",
       "      <td>ASK where {&lt;http://dbpedia.org/resource/Zatch_Bell!&gt; dct:subject dbc:Anime_series_based_on_manga}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>29</th>\n",
       "      <td>Sket Dance foi um anime baseado em mangá?</td>\n",
       "      <td>ASK where {&lt;http://dbpedia.org/resource/Sket_Dance&gt; dct:subject dbc:Anime_series_based_on_manga}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>70</th>\n",
       "      <td>Basilisk Kouga Ninpouchou foi um anime baseado em mangá?</td>\n",
       "      <td>ASK where {&lt;http://dbpedia.org/resource/Basilisk_(manga)&gt; dct:subject dbc:Anime_series_based_on_manga}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>71</th>\n",
       "      <td>Zombie-Loan foi um anime baseado em mangá?</td>\n",
       "      <td>ASK where {&lt;http://dbpedia.org/resource/Zombie-Loan&gt; dct:subject dbc:Anime_series_based_on_manga}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>72</th>\n",
       "      <td>Shoujo Kakumei Utena foi um anime baseado em mangá?</td>\n",
       "      <td>ASK where {&lt;http://dbpedia.org/resource/Revolutionary_Girl_Utena&gt; dct:subject dbc:Anime_series_based_on_manga}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>73</th>\n",
       "      <td>Saki (mangá) foi um anime baseado em mangá?</td>\n",
       "      <td>ASK where {&lt;http://dbpedia.org/resource/Saki_(manga)&gt; dct:subject dbc:Anime_series_based_on_manga}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>74</th>\n",
       "      <td>Junketsu no Maria foi um anime baseado em mangá?</td>\n",
       "      <td>ASK where {&lt;http://dbpedia.org/resource/Maria_the_Virgin_Witch&gt; dct:subject dbc:Anime_series_based_on_manga}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>75</th>\n",
       "      <td>Kiss×sis foi um anime baseado em mangá?</td>\n",
       "      <td>ASK where {&lt;http://dbpedia.org/resource/Kissxsis&gt; dct:subject dbc:Anime_series_based_on_manga}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>76</th>\n",
       "      <td>Deadman Wonderland foi um anime baseado em mangá?</td>\n",
       "      <td>ASK where {&lt;http://dbpedia.org/resource/Deadman_Wonderland&gt; dct:subject dbc:Anime_series_based_on_manga}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>77</th>\n",
       "      <td>Danchigai foi um anime baseado em mangá?</td>\n",
       "      <td>ASK where {&lt;http://dbpedia.org/resource/Danchigai&gt; dct:subject dbc:Anime_series_based_on_manga}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>78</th>\n",
       "      <td>Hanī Hanī no Suteki na Bōken foi um anime baseado em mangá?</td>\n",
       "      <td>ASK where {&lt;http://dbpedia.org/resource/Honey_Honey_no_Suteki_na_Bouken&gt; dct:subject dbc:Anime_series_based_on_manga}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>79</th>\n",
       "      <td>Code:Breaker foi um anime baseado em mangá?</td>\n",
       "      <td>ASK where {&lt;http://dbpedia.org/resource/Code:Breaker&gt; dct:subject dbc:Anime_series_based_on_manga}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>80</th>\n",
       "      <td>Amaenaideyo!! foi um anime baseado em mangá?</td>\n",
       "      <td>ASK where {&lt;http://dbpedia.org/resource/Ah_My_Buddha&gt; dct:subject dbc:Anime_series_based_on_manga}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>81</th>\n",
       "      <td>Mushibugyō foi um anime baseado em mangá?</td>\n",
       "      <td>ASK where {&lt;http://dbpedia.org/resource/Mushibugyo&gt; dct:subject dbc:Anime_series_based_on_manga}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>82</th>\n",
       "      <td>Rave Master foi um anime baseado em mangá?</td>\n",
       "      <td>ASK where {&lt;http://dbpedia.org/resource/Rave_Master&gt; dct:subject dbc:Anime_series_based_on_manga}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>83</th>\n",
       "      <td>Denkigai no Honya-san foi um anime baseado em mangá?</td>\n",
       "      <td>ASK where {&lt;http://dbpedia.org/resource/Denkigai_no_Honya-san&gt; dct:subject dbc:Anime_series_based_on_manga}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>84</th>\n",
       "      <td>Ginga Densetsu Weed foi um anime baseado em mangá?</td>\n",
       "      <td>ASK where {&lt;http://dbpedia.org/resource/Ginga_Legend_Weed&gt; dct:subject dbc:Anime_series_based_on_manga}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>85</th>\n",
       "      <td>Tokimeki Tonight foi um anime baseado em mangá?</td>\n",
       "      <td>ASK where {&lt;http://dbpedia.org/resource/Tokimeki_Tonight&gt; dct:subject dbc:Anime_series_based_on_manga}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>86</th>\n",
       "      <td>Desert Punk foi um anime baseado em mangá?</td>\n",
       "      <td>ASK where {&lt;http://dbpedia.org/resource/Desert_Punk&gt; dct:subject dbc:Anime_series_based_on_manga}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>87</th>\n",
       "      <td>Noragami foi um anime baseado em mangá?</td>\n",
       "      <td>ASK where {&lt;http://dbpedia.org/resource/Noragami&gt; dct:subject dbc:Anime_series_based_on_manga}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>88</th>\n",
       "      <td>Black Lagoon foi um anime baseado em mangá?</td>\n",
       "      <td>ASK where {&lt;http://dbpedia.org/resource/Black_Lagoon&gt; dct:subject dbc:Anime_series_based_on_manga}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>89</th>\n",
       "      <td>Toriko foi um anime baseado em mangá?</td>\n",
       "      <td>ASK where {&lt;http://dbpedia.org/resource/Toriko&gt; dct:subject dbc:Anime_series_based_on_manga}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>90</th>\n",
       "      <td>Tokyo Ghoul foi um anime baseado em mangá?</td>\n",
       "      <td>ASK where {&lt;http://dbpedia.org/resource/Tokyo_Ghoul&gt; dct:subject dbc:Anime_series_based_on_manga}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>91</th>\n",
       "      <td>Hanasakeru Seishounen foi um anime baseado em mangá?</td>\n",
       "      <td>ASK where {&lt;http://dbpedia.org/resource/Hanasakeru_Seishōnen&gt; dct:subject dbc:Anime_series_based_on_manga}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>92</th>\n",
       "      <td>He is My Master foi um anime baseado em mangá?</td>\n",
       "      <td>ASK where {&lt;http://dbpedia.org/resource/He_Is_My_Master&gt; dct:subject dbc:Anime_series_based_on_manga}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>93</th>\n",
       "      <td>Angel Heart (mangá) foi um anime baseado em mangá?</td>\n",
       "      <td>ASK where {&lt;http://dbpedia.org/resource/Angel_Heart_(manga)&gt; dct:subject dbc:Anime_series_based_on_manga}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>94</th>\n",
       "      <td>Knights of Sidonia foi um anime baseado em mangá?</td>\n",
       "      <td>ASK where {&lt;http://dbpedia.org/resource/Knights_of_Sidonia&gt; dct:subject dbc:Anime_series_based_on_manga}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>95</th>\n",
       "      <td>One Piece foi um anime baseado em mangá?</td>\n",
       "      <td>ASK where {&lt;http://dbpedia.org/resource/One_Piece&gt; dct:subject dbc:Anime_series_based_on_manga}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>96</th>\n",
       "      <td>Watashi ga Motenai no wa Dō Kangaetemo Omaera ga Warui! foi um anime baseado em mangá?</td>\n",
       "      <td>ASK where {&lt;http://dbpedia.org/resource/WataMote&gt; dct:subject dbc:Anime_series_based_on_manga}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>97</th>\n",
       "      <td>Cobra (mangá) foi um anime baseado em mangá?</td>\n",
       "      <td>ASK where {&lt;http://dbpedia.org/resource/Cobra_(manga)&gt; dct:subject dbc:Anime_series_based_on_manga}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>98</th>\n",
       "      <td>Fairy Tail foi um anime baseado em mangá?</td>\n",
       "      <td>ASK where {&lt;http://dbpedia.org/resource/Fairy_Tail&gt; dct:subject dbc:Anime_series_based_on_manga}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>99</th>\n",
       "      <td>Emma (mangá) foi um anime baseado em mangá?</td>\n",
       "      <td>ASK where {&lt;http://dbpedia.org/resource/Emma_(manga)&gt; dct:subject dbc:Anime_series_based_on_manga}</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>100 rows × 2 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "                                                                                  question  \\\n",
       "0                                            Akame ga Kill! foi um anime baseado em mangá?   \n",
       "1                                                   Nisekoi foi um anime baseado em mangá?   \n",
       "2                                          Crayon Shin-chan foi um anime baseado em mangá?   \n",
       "3                                          Kuroko no Basket foi um anime baseado em mangá?   \n",
       "4         Kochira Katsushika-ku Kameari Kōen-mae Hashutsujo foi um anime baseado em mangá?   \n",
       "5                                               Atashin'chi foi um anime baseado em mangá?   \n",
       "6                                          Akatsuki no Yona foi um anime baseado em mangá?   \n",
       "7                                              Gakuen Alice foi um anime baseado em mangá?   \n",
       "8                                                 A Channel foi um anime baseado em mangá?   \n",
       "9                                       Seitokai Yakuindomo foi um anime baseado em mangá?   \n",
       "10                                                 Strange+ foi um anime baseado em mangá?   \n",
       "11                                                    009-1 foi um anime baseado em mangá?   \n",
       "12                                             Eyeshield 21 foi um anime baseado em mangá?   \n",
       "13                                                  Unhappy foi um anime baseado em mangá?   \n",
       "14                                         Aishiteruze Baby foi um anime baseado em mangá?   \n",
       "15                                       Shingeki no Kyojin foi um anime baseado em mangá?   \n",
       "16                                          Hunter × Hunter foi um anime baseado em mangá?   \n",
       "17                                                Blood Lad foi um anime baseado em mangá?   \n",
       "18                                            Attacker You! foi um anime baseado em mangá?   \n",
       "19                                             Ao Haru Ride foi um anime baseado em mangá?   \n",
       "20                                               Usagi Drop foi um anime baseado em mangá?   \n",
       "21                                             Aria (mangá) foi um anime baseado em mangá?   \n",
       "22                                         Claymore (mangá) foi um anime baseado em mangá?   \n",
       "23                                           Hajime no Ippo foi um anime baseado em mangá?   \n",
       "24                                    Blade of the Immortal foi um anime baseado em mangá?   \n",
       "25                                   The Knight in the Area foi um anime baseado em mangá?   \n",
       "26                                                Kuma Miko foi um anime baseado em mangá?   \n",
       "27                                              Law of Ueki foi um anime baseado em mangá?   \n",
       "28                                              Zatch Bell! foi um anime baseado em mangá?   \n",
       "29                                               Sket Dance foi um anime baseado em mangá?   \n",
       "..                                                                                     ...   \n",
       "70                                Basilisk Kouga Ninpouchou foi um anime baseado em mangá?   \n",
       "71                                              Zombie-Loan foi um anime baseado em mangá?   \n",
       "72                                     Shoujo Kakumei Utena foi um anime baseado em mangá?   \n",
       "73                                             Saki (mangá) foi um anime baseado em mangá?   \n",
       "74                                        Junketsu no Maria foi um anime baseado em mangá?   \n",
       "75                                                 Kiss×sis foi um anime baseado em mangá?   \n",
       "76                                       Deadman Wonderland foi um anime baseado em mangá?   \n",
       "77                                                Danchigai foi um anime baseado em mangá?   \n",
       "78                             Hanī Hanī no Suteki na Bōken foi um anime baseado em mangá?   \n",
       "79                                             Code:Breaker foi um anime baseado em mangá?   \n",
       "80                                            Amaenaideyo!! foi um anime baseado em mangá?   \n",
       "81                                               Mushibugyō foi um anime baseado em mangá?   \n",
       "82                                              Rave Master foi um anime baseado em mangá?   \n",
       "83                                    Denkigai no Honya-san foi um anime baseado em mangá?   \n",
       "84                                      Ginga Densetsu Weed foi um anime baseado em mangá?   \n",
       "85                                         Tokimeki Tonight foi um anime baseado em mangá?   \n",
       "86                                              Desert Punk foi um anime baseado em mangá?   \n",
       "87                                                 Noragami foi um anime baseado em mangá?   \n",
       "88                                             Black Lagoon foi um anime baseado em mangá?   \n",
       "89                                                   Toriko foi um anime baseado em mangá?   \n",
       "90                                              Tokyo Ghoul foi um anime baseado em mangá?   \n",
       "91                                    Hanasakeru Seishounen foi um anime baseado em mangá?   \n",
       "92                                          He is My Master foi um anime baseado em mangá?   \n",
       "93                                      Angel Heart (mangá) foi um anime baseado em mangá?   \n",
       "94                                       Knights of Sidonia foi um anime baseado em mangá?   \n",
       "95                                                One Piece foi um anime baseado em mangá?   \n",
       "96  Watashi ga Motenai no wa Dō Kangaetemo Omaera ga Warui! foi um anime baseado em mangá?   \n",
       "97                                            Cobra (mangá) foi um anime baseado em mangá?   \n",
       "98                                               Fairy Tail foi um anime baseado em mangá?   \n",
       "99                                             Emma (mangá) foi um anime baseado em mangá?   \n",
       "\n",
       "                                                                                                                                     sparql  \n",
       "0                                      ASK where {<http://dbpedia.org/resource/Akame_ga_Kill!> dct:subject dbc:Anime_series_based_on_manga}  \n",
       "1                                             ASK where {<http://dbpedia.org/resource/Nisekoi> dct:subject dbc:Anime_series_based_on_manga}  \n",
       "2                                    ASK where {<http://dbpedia.org/resource/Crayon_Shin-chan> dct:subject dbc:Anime_series_based_on_manga}  \n",
       "3                                 ASK where {<http://dbpedia.org/resource/Kuroko's_Basketball> dct:subject dbc:Anime_series_based_on_manga}  \n",
       "4   ASK where {<http://dbpedia.org/resource/Kochira_Katsushika-ku_Kameari_Kōen-mae_Hashutsujo> dct:subject dbc:Anime_series_based_on_manga}  \n",
       "5                                         ASK where {<http://dbpedia.org/resource/Atashin'chi> dct:subject dbc:Anime_series_based_on_manga}  \n",
       "6                                    ASK where {<http://dbpedia.org/resource/Yona_of_the_Dawn> dct:subject dbc:Anime_series_based_on_manga}  \n",
       "7                                        ASK where {<http://dbpedia.org/resource/Gakuen_Alice> dct:subject dbc:Anime_series_based_on_manga}  \n",
       "8                                   ASK where {<http://dbpedia.org/resource/A_Channel_(manga)> dct:subject dbc:Anime_series_based_on_manga}  \n",
       "9                                 ASK where {<http://dbpedia.org/resource/Seitokai_Yakuindomo> dct:subject dbc:Anime_series_based_on_manga}  \n",
       "10                                           ASK where {<http://dbpedia.org/resource/Strange+> dct:subject dbc:Anime_series_based_on_manga}  \n",
       "11                                              ASK where {<http://dbpedia.org/resource/009-1> dct:subject dbc:Anime_series_based_on_manga}  \n",
       "12                                       ASK where {<http://dbpedia.org/resource/Eyeshield_21> dct:subject dbc:Anime_series_based_on_manga}  \n",
       "13                                         ASK where {<http://dbpedia.org/resource/Anne_Happy> dct:subject dbc:Anime_series_based_on_manga}  \n",
       "14                                   ASK where {<http://dbpedia.org/resource/Aishiteruze_Baby> dct:subject dbc:Anime_series_based_on_manga}  \n",
       "15                                    ASK where {<http://dbpedia.org/resource/Attack_on_Titan> dct:subject dbc:Anime_series_based_on_manga}  \n",
       "16                                    ASK where {<http://dbpedia.org/resource/Hunter_×_Hunter> dct:subject dbc:Anime_series_based_on_manga}  \n",
       "17                                          ASK where {<http://dbpedia.org/resource/Blood_Lad> dct:subject dbc:Anime_series_based_on_manga}  \n",
       "18                                      ASK where {<http://dbpedia.org/resource/Attacker_You!> dct:subject dbc:Anime_series_based_on_manga}  \n",
       "19                                   ASK where {<http://dbpedia.org/resource/Blue_Spring_Ride> dct:subject dbc:Anime_series_based_on_manga}  \n",
       "20                                         ASK where {<http://dbpedia.org/resource/Bunny_Drop> dct:subject dbc:Anime_series_based_on_manga}  \n",
       "21                                       ASK where {<http://dbpedia.org/resource/Aria_(manga)> dct:subject dbc:Anime_series_based_on_manga}  \n",
       "22                                   ASK where {<http://dbpedia.org/resource/Claymore_(manga)> dct:subject dbc:Anime_series_based_on_manga}  \n",
       "23                                     ASK where {<http://dbpedia.org/resource/Hajime_no_Ippo> dct:subject dbc:Anime_series_based_on_manga}  \n",
       "24                              ASK where {<http://dbpedia.org/resource/Blade_of_the_Immortal> dct:subject dbc:Anime_series_based_on_manga}  \n",
       "25                             ASK where {<http://dbpedia.org/resource/The_Knight_in_the_Area> dct:subject dbc:Anime_series_based_on_manga}  \n",
       "26                         ASK where {<http://dbpedia.org/resource/Kuma_Miko:_Girl_Meets_Bear> dct:subject dbc:Anime_series_based_on_manga}  \n",
       "27                                    ASK where {<http://dbpedia.org/resource/The_Law_of_Ueki> dct:subject dbc:Anime_series_based_on_manga}  \n",
       "28                                        ASK where {<http://dbpedia.org/resource/Zatch_Bell!> dct:subject dbc:Anime_series_based_on_manga}  \n",
       "29                                         ASK where {<http://dbpedia.org/resource/Sket_Dance> dct:subject dbc:Anime_series_based_on_manga}  \n",
       "..                                                                                                                                      ...  \n",
       "70                                   ASK where {<http://dbpedia.org/resource/Basilisk_(manga)> dct:subject dbc:Anime_series_based_on_manga}  \n",
       "71                                        ASK where {<http://dbpedia.org/resource/Zombie-Loan> dct:subject dbc:Anime_series_based_on_manga}  \n",
       "72                           ASK where {<http://dbpedia.org/resource/Revolutionary_Girl_Utena> dct:subject dbc:Anime_series_based_on_manga}  \n",
       "73                                       ASK where {<http://dbpedia.org/resource/Saki_(manga)> dct:subject dbc:Anime_series_based_on_manga}  \n",
       "74                             ASK where {<http://dbpedia.org/resource/Maria_the_Virgin_Witch> dct:subject dbc:Anime_series_based_on_manga}  \n",
       "75                                           ASK where {<http://dbpedia.org/resource/Kissxsis> dct:subject dbc:Anime_series_based_on_manga}  \n",
       "76                                 ASK where {<http://dbpedia.org/resource/Deadman_Wonderland> dct:subject dbc:Anime_series_based_on_manga}  \n",
       "77                                          ASK where {<http://dbpedia.org/resource/Danchigai> dct:subject dbc:Anime_series_based_on_manga}  \n",
       "78                    ASK where {<http://dbpedia.org/resource/Honey_Honey_no_Suteki_na_Bouken> dct:subject dbc:Anime_series_based_on_manga}  \n",
       "79                                       ASK where {<http://dbpedia.org/resource/Code:Breaker> dct:subject dbc:Anime_series_based_on_manga}  \n",
       "80                                       ASK where {<http://dbpedia.org/resource/Ah_My_Buddha> dct:subject dbc:Anime_series_based_on_manga}  \n",
       "81                                         ASK where {<http://dbpedia.org/resource/Mushibugyo> dct:subject dbc:Anime_series_based_on_manga}  \n",
       "82                                        ASK where {<http://dbpedia.org/resource/Rave_Master> dct:subject dbc:Anime_series_based_on_manga}  \n",
       "83                              ASK where {<http://dbpedia.org/resource/Denkigai_no_Honya-san> dct:subject dbc:Anime_series_based_on_manga}  \n",
       "84                                  ASK where {<http://dbpedia.org/resource/Ginga_Legend_Weed> dct:subject dbc:Anime_series_based_on_manga}  \n",
       "85                                   ASK where {<http://dbpedia.org/resource/Tokimeki_Tonight> dct:subject dbc:Anime_series_based_on_manga}  \n",
       "86                                        ASK where {<http://dbpedia.org/resource/Desert_Punk> dct:subject dbc:Anime_series_based_on_manga}  \n",
       "87                                           ASK where {<http://dbpedia.org/resource/Noragami> dct:subject dbc:Anime_series_based_on_manga}  \n",
       "88                                       ASK where {<http://dbpedia.org/resource/Black_Lagoon> dct:subject dbc:Anime_series_based_on_manga}  \n",
       "89                                             ASK where {<http://dbpedia.org/resource/Toriko> dct:subject dbc:Anime_series_based_on_manga}  \n",
       "90                                        ASK where {<http://dbpedia.org/resource/Tokyo_Ghoul> dct:subject dbc:Anime_series_based_on_manga}  \n",
       "91                               ASK where {<http://dbpedia.org/resource/Hanasakeru_Seishōnen> dct:subject dbc:Anime_series_based_on_manga}  \n",
       "92                                    ASK where {<http://dbpedia.org/resource/He_Is_My_Master> dct:subject dbc:Anime_series_based_on_manga}  \n",
       "93                                ASK where {<http://dbpedia.org/resource/Angel_Heart_(manga)> dct:subject dbc:Anime_series_based_on_manga}  \n",
       "94                                 ASK where {<http://dbpedia.org/resource/Knights_of_Sidonia> dct:subject dbc:Anime_series_based_on_manga}  \n",
       "95                                          ASK where {<http://dbpedia.org/resource/One_Piece> dct:subject dbc:Anime_series_based_on_manga}  \n",
       "96                                           ASK where {<http://dbpedia.org/resource/WataMote> dct:subject dbc:Anime_series_based_on_manga}  \n",
       "97                                      ASK where {<http://dbpedia.org/resource/Cobra_(manga)> dct:subject dbc:Anime_series_based_on_manga}  \n",
       "98                                         ASK where {<http://dbpedia.org/resource/Fairy_Tail> dct:subject dbc:Anime_series_based_on_manga}  \n",
       "99                                       ASK where {<http://dbpedia.org/resource/Emma_(manga)> dct:subject dbc:Anime_series_based_on_manga}  \n",
       "\n",
       "[100 rows x 2 columns]"
      ]
     },
     "execution_count": 4,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "df_pairs = pd.DataFrame.from_dict(pairs)\n",
    "df_pairs"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Os resultados retornados não estão utilizando as URIs de forma reduzida, para resolver isso basta passar os prefixos como argumento da função."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "[('dbr:', 'http://dbpedia.org/resource/'), ('dbo:', 'http://dbpedia.org/ontology/')]\n"
     ]
    }
   ],
   "source": [
    "prefixes = \"PREFIX dbr: <http://dbpedia.org/resource/>\\\n",
    "            PREFIX dbo: <http://dbpedia.org/ontology/>\"\n",
    "list_of_prefixes = utils.convert_prefixes_to_list(prefixes)\n",
    "print(list_of_prefixes)\n",
    "pairs = generator.build_pairs_from_template(template, prefixes, list_of_prefixes)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>question</th>\n",
       "      <th>sparql</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Medaka Box foi um anime baseado em mangá?</td>\n",
       "      <td>ASK where {dbr:Medaka_Box dct:subject dbc:Anime_series_based_on_manga}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Pet Shop of Horrors foi um anime baseado em mangá?</td>\n",
       "      <td>ASK where {dbr:Pet_Shop_of_Horrors dct:subject dbc:Anime_series_based_on_manga}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Himōto! Umaru-chan foi um anime baseado em mangá?</td>\n",
       "      <td>ASK where {dbr:Himouto!_Umaru-chan dct:subject dbc:Anime_series_based_on_manga}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Big Order foi um anime baseado em mangá?</td>\n",
       "      <td>ASK where {dbr:Big_Order dct:subject dbc:Anime_series_based_on_manga}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Saki (mangá) foi um anime baseado em mangá?</td>\n",
       "      <td>ASK where {dbr:Saki_(manga) dct:subject dbc:Anime_series_based_on_manga}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>Ao no Exorcist foi um anime baseado em mangá?</td>\n",
       "      <td>ASK where {dbr:Blue_Exorcist dct:subject dbc:Anime_series_based_on_manga}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>Gakuen Alice foi um anime baseado em mangá?</td>\n",
       "      <td>ASK where {dbr:Gakuen_Alice dct:subject dbc:Anime_series_based_on_manga}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>Ai Shite Knight foi um anime baseado em mangá?</td>\n",
       "      <td>ASK where {dbr:Ai_Shite_Knight dct:subject dbc:Anime_series_based_on_manga}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>Maison Ikkoku foi um anime baseado em mangá?</td>\n",
       "      <td>ASK where {dbr:Maison_Ikkoku dct:subject dbc:Anime_series_based_on_manga}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>Mangaka-san to Assistant-san to foi um anime baseado em mangá?</td>\n",
       "      <td>ASK where {dbr:The_Comic_Artist_and_His_Assistants dct:subject dbc:Anime_series_based_on_manga}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10</th>\n",
       "      <td>Tokimeki Tonight foi um anime baseado em mangá?</td>\n",
       "      <td>ASK where {dbr:Tokimeki_Tonight dct:subject dbc:Anime_series_based_on_manga}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11</th>\n",
       "      <td>Shingeki no Kyojin foi um anime baseado em mangá?</td>\n",
       "      <td>ASK where {dbr:Attack_on_Titan dct:subject dbc:Anime_series_based_on_manga}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>12</th>\n",
       "      <td>Aishiteruze Baby foi um anime baseado em mangá?</td>\n",
       "      <td>ASK where {dbr:Aishiteruze_Baby dct:subject dbc:Anime_series_based_on_manga}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>13</th>\n",
       "      <td>Aku no Hana foi um anime baseado em mangá?</td>\n",
       "      <td>ASK where {dbr:The_Flowers_of_Evil_(manga) dct:subject dbc:Anime_series_based_on_manga}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>14</th>\n",
       "      <td>Black Cat foi um anime baseado em mangá?</td>\n",
       "      <td>ASK where {dbr:Black_Cat_(manga) dct:subject dbc:Anime_series_based_on_manga}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>15</th>\n",
       "      <td>Ai Mai Mi foi um anime baseado em mangá?</td>\n",
       "      <td>ASK where {dbr:Ai_Mai_Mi dct:subject dbc:Anime_series_based_on_manga}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>16</th>\n",
       "      <td>Deadman Wonderland foi um anime baseado em mangá?</td>\n",
       "      <td>ASK where {dbr:Deadman_Wonderland dct:subject dbc:Anime_series_based_on_manga}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>17</th>\n",
       "      <td>Skip Beat! foi um anime baseado em mangá?</td>\n",
       "      <td>ASK where {dbr:Skip_Beat! dct:subject dbc:Anime_series_based_on_manga}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>18</th>\n",
       "      <td>Kiss×sis foi um anime baseado em mangá?</td>\n",
       "      <td>ASK where {dbr:Kissxsis dct:subject dbc:Anime_series_based_on_manga}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>19</th>\n",
       "      <td>Atashin'chi foi um anime baseado em mangá?</td>\n",
       "      <td>ASK where {dbr:Atashin'chi dct:subject dbc:Anime_series_based_on_manga}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>20</th>\n",
       "      <td>Yumekui Merry foi um anime baseado em mangá?</td>\n",
       "      <td>ASK where {dbr:Dream_Eater_Merry dct:subject dbc:Anime_series_based_on_manga}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>21</th>\n",
       "      <td>Detective Conan foi um anime baseado em mangá?</td>\n",
       "      <td>ASK where {dbr:Case_Closed dct:subject dbc:Anime_series_based_on_manga}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>22</th>\n",
       "      <td>Sayonara, Zetsubou-Sensei foi um anime baseado em mangá?</td>\n",
       "      <td>ASK where {dbr:Sayonara,_Zetsubou-Sensei dct:subject dbc:Anime_series_based_on_manga}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>23</th>\n",
       "      <td>Emma (mangá) foi um anime baseado em mangá?</td>\n",
       "      <td>ASK where {dbr:Emma_(manga) dct:subject dbc:Anime_series_based_on_manga}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>24</th>\n",
       "      <td>Air Master foi um anime baseado em mangá?</td>\n",
       "      <td>ASK where {dbr:Air_Master dct:subject dbc:Anime_series_based_on_manga}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>25</th>\n",
       "      <td>Blade of the Immortal foi um anime baseado em mangá?</td>\n",
       "      <td>ASK where {dbr:Blade_of_the_Immortal dct:subject dbc:Anime_series_based_on_manga}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>26</th>\n",
       "      <td>Soul Eater foi um anime baseado em mangá?</td>\n",
       "      <td>ASK where {dbr:Soul_Eater_(manga) dct:subject dbc:Anime_series_based_on_manga}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>27</th>\n",
       "      <td>Code:Breaker foi um anime baseado em mangá?</td>\n",
       "      <td>ASK where {dbr:Code:Breaker dct:subject dbc:Anime_series_based_on_manga}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>28</th>\n",
       "      <td>Black Lagoon foi um anime baseado em mangá?</td>\n",
       "      <td>ASK where {dbr:Black_Lagoon dct:subject dbc:Anime_series_based_on_manga}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>29</th>\n",
       "      <td>Okusama ga Seito Kaichō! foi um anime baseado em mangá?</td>\n",
       "      <td>ASK where {dbr:My_Wife_is_the_Student_Council_President dct:subject dbc:Anime_series_based_on_manga}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>70</th>\n",
       "      <td>Angelic Layer foi um anime baseado em mangá?</td>\n",
       "      <td>ASK where {dbr:Angelic_Layer dct:subject dbc:Anime_series_based_on_manga}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>71</th>\n",
       "      <td>Azumanga Daioh foi um anime baseado em mangá?</td>\n",
       "      <td>ASK where {dbr:Azumanga_Daioh dct:subject dbc:Anime_series_based_on_manga}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>72</th>\n",
       "      <td>Arata Kangatari foi um anime baseado em mangá?</td>\n",
       "      <td>ASK where {dbr:Arata:_The_Legend dct:subject dbc:Anime_series_based_on_manga}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>73</th>\n",
       "      <td>Unhappy foi um anime baseado em mangá?</td>\n",
       "      <td>ASK where {dbr:Anne_Happy dct:subject dbc:Anime_series_based_on_manga}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>74</th>\n",
       "      <td>Vampire Knight foi um anime baseado em mangá?</td>\n",
       "      <td>ASK where {dbr:Vampire_Knight dct:subject dbc:Anime_series_based_on_manga}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>75</th>\n",
       "      <td>Nisekoi foi um anime baseado em mangá?</td>\n",
       "      <td>ASK where {dbr:Nisekoi dct:subject dbc:Anime_series_based_on_manga}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>76</th>\n",
       "      <td>Kotoura-san foi um anime baseado em mangá?</td>\n",
       "      <td>ASK where {dbr:Kotoura-san dct:subject dbc:Anime_series_based_on_manga}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>77</th>\n",
       "      <td>Ore Monogatari!! foi um anime baseado em mangá?</td>\n",
       "      <td>ASK where {dbr:My_Love_Story!! dct:subject dbc:Anime_series_based_on_manga}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>78</th>\n",
       "      <td>Flying Witch foi um anime baseado em mangá?</td>\n",
       "      <td>ASK where {dbr:Flying_Witch dct:subject dbc:Anime_series_based_on_manga}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>79</th>\n",
       "      <td>One Piece foi um anime baseado em mangá?</td>\n",
       "      <td>ASK where {dbr:One_Piece dct:subject dbc:Anime_series_based_on_manga}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>80</th>\n",
       "      <td>Crayon Shin-chan foi um anime baseado em mangá?</td>\n",
       "      <td>ASK where {dbr:Crayon_Shin-chan dct:subject dbc:Anime_series_based_on_manga}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>81</th>\n",
       "      <td>Jitsu wa Watashi wa foi um anime baseado em mangá?</td>\n",
       "      <td>ASK where {dbr:My_Monster_Secret dct:subject dbc:Anime_series_based_on_manga}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>82</th>\n",
       "      <td>Baki the Grappler foi um anime baseado em mangá?</td>\n",
       "      <td>ASK where {dbr:Baki_the_Grappler dct:subject dbc:Anime_series_based_on_manga}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>83</th>\n",
       "      <td>Kuma Miko foi um anime baseado em mangá?</td>\n",
       "      <td>ASK where {dbr:Kuma_Miko:_Girl_Meets_Bear dct:subject dbc:Anime_series_based_on_manga}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>84</th>\n",
       "      <td>The Knight in the Area foi um anime baseado em mangá?</td>\n",
       "      <td>ASK where {dbr:The_Knight_in_the_Area dct:subject dbc:Anime_series_based_on_manga}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>85</th>\n",
       "      <td>Ginga Densetsu Weed foi um anime baseado em mangá?</td>\n",
       "      <td>ASK where {dbr:Ginga_Legend_Weed dct:subject dbc:Anime_series_based_on_manga}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>86</th>\n",
       "      <td>Monster Musume no Iru Nichijou foi um anime baseado em mangá?</td>\n",
       "      <td>ASK where {dbr:Monster_Musume dct:subject dbc:Anime_series_based_on_manga}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>87</th>\n",
       "      <td>Zatch Bell! foi um anime baseado em mangá?</td>\n",
       "      <td>ASK where {dbr:Zatch_Bell! dct:subject dbc:Anime_series_based_on_manga}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>88</th>\n",
       "      <td>Claymore (mangá) foi um anime baseado em mangá?</td>\n",
       "      <td>ASK where {dbr:Claymore_(manga) dct:subject dbc:Anime_series_based_on_manga}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>89</th>\n",
       "      <td>Zombie-Loan foi um anime baseado em mangá?</td>\n",
       "      <td>ASK where {dbr:Zombie-Loan dct:subject dbc:Anime_series_based_on_manga}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>90</th>\n",
       "      <td>Princess Princess foi um anime baseado em mangá?</td>\n",
       "      <td>ASK where {dbr:Princess_Princess_(manga) dct:subject dbc:Anime_series_based_on_manga}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>91</th>\n",
       "      <td>Danchigai foi um anime baseado em mangá?</td>\n",
       "      <td>ASK where {dbr:Danchigai dct:subject dbc:Anime_series_based_on_manga}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>92</th>\n",
       "      <td>Bakuman foi um anime baseado em mangá?</td>\n",
       "      <td>ASK where {dbr:Bakuman dct:subject dbc:Anime_series_based_on_manga}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>93</th>\n",
       "      <td>Ayashi no Ceres foi um anime baseado em mangá?</td>\n",
       "      <td>ASK where {dbr:Ceres,_Celestial_Legend dct:subject dbc:Anime_series_based_on_manga}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>94</th>\n",
       "      <td>World Trigger foi um anime baseado em mangá?</td>\n",
       "      <td>ASK where {dbr:World_Trigger dct:subject dbc:Anime_series_based_on_manga}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>95</th>\n",
       "      <td>Tokyo Ghoul foi um anime baseado em mangá?</td>\n",
       "      <td>ASK where {dbr:Tokyo_Ghoul dct:subject dbc:Anime_series_based_on_manga}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>96</th>\n",
       "      <td>Highschool of the Dead foi um anime baseado em mangá?</td>\n",
       "      <td>ASK where {dbr:Highschool_of_the_Dead dct:subject dbc:Anime_series_based_on_manga}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>97</th>\n",
       "      <td>Gin no Saji foi um anime baseado em mangá?</td>\n",
       "      <td>ASK where {dbr:Silver_Spoon_(manga) dct:subject dbc:Anime_series_based_on_manga}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>98</th>\n",
       "      <td>A Channel foi um anime baseado em mangá?</td>\n",
       "      <td>ASK where {dbr:A_Channel_(manga) dct:subject dbc:Anime_series_based_on_manga}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>99</th>\n",
       "      <td>Katekyō Hitman Reborn! foi um anime baseado em mangá?</td>\n",
       "      <td>ASK where {dbr:Reborn! dct:subject dbc:Anime_series_based_on_manga}</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>100 rows × 2 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "                                                          question  \\\n",
       "0                        Medaka Box foi um anime baseado em mangá?   \n",
       "1               Pet Shop of Horrors foi um anime baseado em mangá?   \n",
       "2                Himōto! Umaru-chan foi um anime baseado em mangá?   \n",
       "3                         Big Order foi um anime baseado em mangá?   \n",
       "4                      Saki (mangá) foi um anime baseado em mangá?   \n",
       "5                    Ao no Exorcist foi um anime baseado em mangá?   \n",
       "6                      Gakuen Alice foi um anime baseado em mangá?   \n",
       "7                   Ai Shite Knight foi um anime baseado em mangá?   \n",
       "8                     Maison Ikkoku foi um anime baseado em mangá?   \n",
       "9   Mangaka-san to Assistant-san to foi um anime baseado em mangá?   \n",
       "10                 Tokimeki Tonight foi um anime baseado em mangá?   \n",
       "11               Shingeki no Kyojin foi um anime baseado em mangá?   \n",
       "12                 Aishiteruze Baby foi um anime baseado em mangá?   \n",
       "13                      Aku no Hana foi um anime baseado em mangá?   \n",
       "14                        Black Cat foi um anime baseado em mangá?   \n",
       "15                        Ai Mai Mi foi um anime baseado em mangá?   \n",
       "16               Deadman Wonderland foi um anime baseado em mangá?   \n",
       "17                       Skip Beat! foi um anime baseado em mangá?   \n",
       "18                         Kiss×sis foi um anime baseado em mangá?   \n",
       "19                      Atashin'chi foi um anime baseado em mangá?   \n",
       "20                    Yumekui Merry foi um anime baseado em mangá?   \n",
       "21                  Detective Conan foi um anime baseado em mangá?   \n",
       "22        Sayonara, Zetsubou-Sensei foi um anime baseado em mangá?   \n",
       "23                     Emma (mangá) foi um anime baseado em mangá?   \n",
       "24                       Air Master foi um anime baseado em mangá?   \n",
       "25            Blade of the Immortal foi um anime baseado em mangá?   \n",
       "26                       Soul Eater foi um anime baseado em mangá?   \n",
       "27                     Code:Breaker foi um anime baseado em mangá?   \n",
       "28                     Black Lagoon foi um anime baseado em mangá?   \n",
       "29         Okusama ga Seito Kaichō! foi um anime baseado em mangá?   \n",
       "..                                                             ...   \n",
       "70                    Angelic Layer foi um anime baseado em mangá?   \n",
       "71                   Azumanga Daioh foi um anime baseado em mangá?   \n",
       "72                  Arata Kangatari foi um anime baseado em mangá?   \n",
       "73                          Unhappy foi um anime baseado em mangá?   \n",
       "74                   Vampire Knight foi um anime baseado em mangá?   \n",
       "75                          Nisekoi foi um anime baseado em mangá?   \n",
       "76                      Kotoura-san foi um anime baseado em mangá?   \n",
       "77                 Ore Monogatari!! foi um anime baseado em mangá?   \n",
       "78                     Flying Witch foi um anime baseado em mangá?   \n",
       "79                        One Piece foi um anime baseado em mangá?   \n",
       "80                 Crayon Shin-chan foi um anime baseado em mangá?   \n",
       "81              Jitsu wa Watashi wa foi um anime baseado em mangá?   \n",
       "82                Baki the Grappler foi um anime baseado em mangá?   \n",
       "83                        Kuma Miko foi um anime baseado em mangá?   \n",
       "84           The Knight in the Area foi um anime baseado em mangá?   \n",
       "85              Ginga Densetsu Weed foi um anime baseado em mangá?   \n",
       "86   Monster Musume no Iru Nichijou foi um anime baseado em mangá?   \n",
       "87                      Zatch Bell! foi um anime baseado em mangá?   \n",
       "88                 Claymore (mangá) foi um anime baseado em mangá?   \n",
       "89                      Zombie-Loan foi um anime baseado em mangá?   \n",
       "90                Princess Princess foi um anime baseado em mangá?   \n",
       "91                        Danchigai foi um anime baseado em mangá?   \n",
       "92                          Bakuman foi um anime baseado em mangá?   \n",
       "93                  Ayashi no Ceres foi um anime baseado em mangá?   \n",
       "94                    World Trigger foi um anime baseado em mangá?   \n",
       "95                      Tokyo Ghoul foi um anime baseado em mangá?   \n",
       "96           Highschool of the Dead foi um anime baseado em mangá?   \n",
       "97                      Gin no Saji foi um anime baseado em mangá?   \n",
       "98                        A Channel foi um anime baseado em mangá?   \n",
       "99           Katekyō Hitman Reborn! foi um anime baseado em mangá?   \n",
       "\n",
       "                                                                                                  sparql  \n",
       "0                                 ASK where {dbr:Medaka_Box dct:subject dbc:Anime_series_based_on_manga}  \n",
       "1                        ASK where {dbr:Pet_Shop_of_Horrors dct:subject dbc:Anime_series_based_on_manga}  \n",
       "2                        ASK where {dbr:Himouto!_Umaru-chan dct:subject dbc:Anime_series_based_on_manga}  \n",
       "3                                  ASK where {dbr:Big_Order dct:subject dbc:Anime_series_based_on_manga}  \n",
       "4                               ASK where {dbr:Saki_(manga) dct:subject dbc:Anime_series_based_on_manga}  \n",
       "5                              ASK where {dbr:Blue_Exorcist dct:subject dbc:Anime_series_based_on_manga}  \n",
       "6                               ASK where {dbr:Gakuen_Alice dct:subject dbc:Anime_series_based_on_manga}  \n",
       "7                            ASK where {dbr:Ai_Shite_Knight dct:subject dbc:Anime_series_based_on_manga}  \n",
       "8                              ASK where {dbr:Maison_Ikkoku dct:subject dbc:Anime_series_based_on_manga}  \n",
       "9        ASK where {dbr:The_Comic_Artist_and_His_Assistants dct:subject dbc:Anime_series_based_on_manga}  \n",
       "10                          ASK where {dbr:Tokimeki_Tonight dct:subject dbc:Anime_series_based_on_manga}  \n",
       "11                           ASK where {dbr:Attack_on_Titan dct:subject dbc:Anime_series_based_on_manga}  \n",
       "12                          ASK where {dbr:Aishiteruze_Baby dct:subject dbc:Anime_series_based_on_manga}  \n",
       "13               ASK where {dbr:The_Flowers_of_Evil_(manga) dct:subject dbc:Anime_series_based_on_manga}  \n",
       "14                         ASK where {dbr:Black_Cat_(manga) dct:subject dbc:Anime_series_based_on_manga}  \n",
       "15                                 ASK where {dbr:Ai_Mai_Mi dct:subject dbc:Anime_series_based_on_manga}  \n",
       "16                        ASK where {dbr:Deadman_Wonderland dct:subject dbc:Anime_series_based_on_manga}  \n",
       "17                                ASK where {dbr:Skip_Beat! dct:subject dbc:Anime_series_based_on_manga}  \n",
       "18                                  ASK where {dbr:Kissxsis dct:subject dbc:Anime_series_based_on_manga}  \n",
       "19                               ASK where {dbr:Atashin'chi dct:subject dbc:Anime_series_based_on_manga}  \n",
       "20                         ASK where {dbr:Dream_Eater_Merry dct:subject dbc:Anime_series_based_on_manga}  \n",
       "21                               ASK where {dbr:Case_Closed dct:subject dbc:Anime_series_based_on_manga}  \n",
       "22                 ASK where {dbr:Sayonara,_Zetsubou-Sensei dct:subject dbc:Anime_series_based_on_manga}  \n",
       "23                              ASK where {dbr:Emma_(manga) dct:subject dbc:Anime_series_based_on_manga}  \n",
       "24                                ASK where {dbr:Air_Master dct:subject dbc:Anime_series_based_on_manga}  \n",
       "25                     ASK where {dbr:Blade_of_the_Immortal dct:subject dbc:Anime_series_based_on_manga}  \n",
       "26                        ASK where {dbr:Soul_Eater_(manga) dct:subject dbc:Anime_series_based_on_manga}  \n",
       "27                              ASK where {dbr:Code:Breaker dct:subject dbc:Anime_series_based_on_manga}  \n",
       "28                              ASK where {dbr:Black_Lagoon dct:subject dbc:Anime_series_based_on_manga}  \n",
       "29  ASK where {dbr:My_Wife_is_the_Student_Council_President dct:subject dbc:Anime_series_based_on_manga}  \n",
       "..                                                                                                   ...  \n",
       "70                             ASK where {dbr:Angelic_Layer dct:subject dbc:Anime_series_based_on_manga}  \n",
       "71                            ASK where {dbr:Azumanga_Daioh dct:subject dbc:Anime_series_based_on_manga}  \n",
       "72                         ASK where {dbr:Arata:_The_Legend dct:subject dbc:Anime_series_based_on_manga}  \n",
       "73                                ASK where {dbr:Anne_Happy dct:subject dbc:Anime_series_based_on_manga}  \n",
       "74                            ASK where {dbr:Vampire_Knight dct:subject dbc:Anime_series_based_on_manga}  \n",
       "75                                   ASK where {dbr:Nisekoi dct:subject dbc:Anime_series_based_on_manga}  \n",
       "76                               ASK where {dbr:Kotoura-san dct:subject dbc:Anime_series_based_on_manga}  \n",
       "77                           ASK where {dbr:My_Love_Story!! dct:subject dbc:Anime_series_based_on_manga}  \n",
       "78                              ASK where {dbr:Flying_Witch dct:subject dbc:Anime_series_based_on_manga}  \n",
       "79                                 ASK where {dbr:One_Piece dct:subject dbc:Anime_series_based_on_manga}  \n",
       "80                          ASK where {dbr:Crayon_Shin-chan dct:subject dbc:Anime_series_based_on_manga}  \n",
       "81                         ASK where {dbr:My_Monster_Secret dct:subject dbc:Anime_series_based_on_manga}  \n",
       "82                         ASK where {dbr:Baki_the_Grappler dct:subject dbc:Anime_series_based_on_manga}  \n",
       "83                ASK where {dbr:Kuma_Miko:_Girl_Meets_Bear dct:subject dbc:Anime_series_based_on_manga}  \n",
       "84                    ASK where {dbr:The_Knight_in_the_Area dct:subject dbc:Anime_series_based_on_manga}  \n",
       "85                         ASK where {dbr:Ginga_Legend_Weed dct:subject dbc:Anime_series_based_on_manga}  \n",
       "86                            ASK where {dbr:Monster_Musume dct:subject dbc:Anime_series_based_on_manga}  \n",
       "87                               ASK where {dbr:Zatch_Bell! dct:subject dbc:Anime_series_based_on_manga}  \n",
       "88                          ASK where {dbr:Claymore_(manga) dct:subject dbc:Anime_series_based_on_manga}  \n",
       "89                               ASK where {dbr:Zombie-Loan dct:subject dbc:Anime_series_based_on_manga}  \n",
       "90                 ASK where {dbr:Princess_Princess_(manga) dct:subject dbc:Anime_series_based_on_manga}  \n",
       "91                                 ASK where {dbr:Danchigai dct:subject dbc:Anime_series_based_on_manga}  \n",
       "92                                   ASK where {dbr:Bakuman dct:subject dbc:Anime_series_based_on_manga}  \n",
       "93                   ASK where {dbr:Ceres,_Celestial_Legend dct:subject dbc:Anime_series_based_on_manga}  \n",
       "94                             ASK where {dbr:World_Trigger dct:subject dbc:Anime_series_based_on_manga}  \n",
       "95                               ASK where {dbr:Tokyo_Ghoul dct:subject dbc:Anime_series_based_on_manga}  \n",
       "96                    ASK where {dbr:Highschool_of_the_Dead dct:subject dbc:Anime_series_based_on_manga}  \n",
       "97                      ASK where {dbr:Silver_Spoon_(manga) dct:subject dbc:Anime_series_based_on_manga}  \n",
       "98                         ASK where {dbr:A_Channel_(manga) dct:subject dbc:Anime_series_based_on_manga}  \n",
       "99                                   ASK where {dbr:Reborn! dct:subject dbc:Anime_series_based_on_manga}  \n",
       "\n",
       "[100 rows x 2 columns]"
      ]
     },
     "execution_count": 6,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "df_pairs = pd.DataFrame.from_dict(pairs)\n",
    "df_pairs"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## QApedia - Carregando arquivo de templates para geração\n",
    "\n",
    "O arquivo dos templates deve se encontrar na seguinte estrutura.\n",
    "```\n",
    "question;query;generator_query\n",
    "Qual tipo de governo de <A>?;SELECT ?uri WHERE{ <A> <http://pt.dbpedia.org/property/tipoGoverno> ?uri .};SELECT distinct ?a WHERE{ ?a <http://pt.dbpedia.org/property/tipoGoverno> ?uri . }\n",
    "```\n",
    "\n",
    "**Observações sobre o arquivo:**\n",
    "* Cada linha representa um template\n",
    "* Um template é definido no formato \"question;query;generator_query\"\n",
    "* A primeira linha contém o cabeçalho\n",
    "* As variavéis são extraídas automaticamente na leitura do arquivo, desde que a *generator_query* esteja em um formato válido.\n",
    "    * As variáveis da *generator_query* são no formato $?a ?b .. ?y ?z$ e correspondem as lacunas $<A> <B> ... <Y> <Z>$\n",
    "    * A *generator_query* não possui campo de label a fim de facilitar a sua reutilização para outros idiomas.\n",
    "    \n",
    "   \n",
    "Para carregar o arquivo contendo os templates, use a função ``load_templates`` do módulo [io](https://qapedia.readthedocs.io/pt/latest/QApedia.html#module-QApedia.io). Caso esteja usando prefixos, o arquivo de prefixos pode ser carregado através da função ``load_prefixes`` que também se encontra disponível no módulo [io](https://qapedia.readthedocs.io/pt/latest/QApedia.html#module-QApedia.io)."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Quantidade de prefixos: 9\n",
      "Quantidade de templates: 5\n"
     ]
    }
   ],
   "source": [
    "prefixes, list_of_prefixes = io.load_prefixes(\"data/prefixes.txt\")\n",
    "templates = io.load_templates(\"data/example.csv\")\n",
    "print(f\"Quantidade de prefixos: {len(list_of_prefixes)}\")\n",
    "print(f\"Quantidade de templates: {len(templates)}\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "**Arquivo contendo os templates**"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>question</th>\n",
       "      <th>query</th>\n",
       "      <th>generator_query</th>\n",
       "      <th>variables</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>&lt;A&gt; e &lt;B&gt; são produzidos por qual empresa?</td>\n",
       "      <td>SELECT DISTINCT ?uri where { &lt;A&gt; dbpedia2:manufacturer ?uri . &lt;B&gt; dbpedia2:manufacturer ?uri }</td>\n",
       "      <td>select distinct ?a ?b where { ?a dbpedia2:manufacturer ?uri . ?b dbpedia2:manufacturer ?uri }</td>\n",
       "      <td>[a, b]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>&lt;A&gt; e &lt;B&gt; são os trabalhos notáveis de qual escritor(a)?</td>\n",
       "      <td>SELECT DISTINCT ?uri where { ?uri dbpedia2:notableworks &lt;A&gt; . ?uri dbpedia2:notableworks &lt;B&gt; . ?uri a dbo:writer }</td>\n",
       "      <td>select distinct ?a ?b where { ?uri dbpedia2:notableworks ?a . ?uri dbpedia2:notableworks ?b . ?uri a dbo:writer }</td>\n",
       "      <td>[a, b]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>&lt;A&gt; e &lt;B&gt; são escritos por qual autor(a)?</td>\n",
       "      <td>SELECT DISTINCT ?uri where { &lt;A&gt; dbpedia2:writer ?uri . &lt;B&gt; dbo:author ?uri }</td>\n",
       "      <td>select distinct ?a ?b where { ?a dbpedia2:writer ?uri . ?b dbo:author ?uri }</td>\n",
       "      <td>[a, b]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>&lt;A&gt; escreveu qual livro?</td>\n",
       "      <td>SELECT DISTINCT ?uri where { ?uri dbo:author &lt;A&gt; }</td>\n",
       "      <td>select distinct ?a where { ?uri dbo:author ?a }</td>\n",
       "      <td>[a]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>&lt;A&gt; pertence a qual partido político?</td>\n",
       "      <td>SELECT DISTINCT ?uri where { &lt;A&gt; dbo:occupation ?uri }</td>\n",
       "      <td>select distinct ?a where { ?a dbo:occupation ?uri }</td>\n",
       "      <td>[a]</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                                                   question  \\\n",
       "0                <A> e <B> são produzidos por qual empresa?   \n",
       "1  <A> e <B> são os trabalhos notáveis de qual escritor(a)?   \n",
       "2                 <A> e <B> são escritos por qual autor(a)?   \n",
       "3                                  <A> escreveu qual livro?   \n",
       "4                     <A> pertence a qual partido político?   \n",
       "\n",
       "                                                                                                                query  \\\n",
       "0                      SELECT DISTINCT ?uri where { <A> dbpedia2:manufacturer ?uri . <B> dbpedia2:manufacturer ?uri }   \n",
       "1  SELECT DISTINCT ?uri where { ?uri dbpedia2:notableworks <A> . ?uri dbpedia2:notableworks <B> . ?uri a dbo:writer }   \n",
       "2                                       SELECT DISTINCT ?uri where { <A> dbpedia2:writer ?uri . <B> dbo:author ?uri }   \n",
       "3                                                                  SELECT DISTINCT ?uri where { ?uri dbo:author <A> }   \n",
       "4                                                              SELECT DISTINCT ?uri where { <A> dbo:occupation ?uri }   \n",
       "\n",
       "                                                                                                     generator_query  \\\n",
       "0                      select distinct ?a ?b where { ?a dbpedia2:manufacturer ?uri . ?b dbpedia2:manufacturer ?uri }   \n",
       "1  select distinct ?a ?b where { ?uri dbpedia2:notableworks ?a . ?uri dbpedia2:notableworks ?b . ?uri a dbo:writer }   \n",
       "2                                       select distinct ?a ?b where { ?a dbpedia2:writer ?uri . ?b dbo:author ?uri }   \n",
       "3                                                                    select distinct ?a where { ?uri dbo:author ?a }   \n",
       "4                                                                select distinct ?a where { ?a dbo:occupation ?uri }   \n",
       "\n",
       "  variables  \n",
       "0    [a, b]  \n",
       "1    [a, b]  \n",
       "2    [a, b]  \n",
       "3       [a]  \n",
       "4       [a]  "
      ]
     },
     "execution_count": 8,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "templates"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "**Lista de prefixos definida**\n",
    "\n",
    "1. prefixos sem pré-processamento"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "PREFIX owl: <http://www.w3.org/2002/07/owl#>\n",
      "PREFIX xsd: <http://www.w3.org/2001/XMLSchema#>\n",
      "PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n",
      "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\n",
      "PREFIX foaf: <http://xmlns.com/foaf/0.1/>\n",
      "PREFIX dc: <http://purl.org/dc/elements/1.1/>\n",
      "PREFIX : <http://dbpedia.org/resource/>\n",
      "PREFIX dbpedia2: <http://dbpedia.org/property/>\n",
      "PREFIX dbpedia: <http://dbpedia.org/>\n",
      "PREFIX skos: <http://www.w3.org/2004/02/skos/core#>\n"
     ]
    }
   ],
   "source": [
    "print(prefixes)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "2. prefixos convertidos em lista"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[('owl:', 'http://www.w3.org/2002/07/owl#'),\n",
       " ('xsd:', 'http://www.w3.org/2001/XMLSchema#'),\n",
       " ('rdfs:', 'http://www.w3.org/2000/01/rdf-schema#'),\n",
       " ('rdf:', 'http://www.w3.org/1999/02/22-rdf-syntax-ns#'),\n",
       " ('foaf:', 'http://xmlns.com/foaf/0.1/'),\n",
       " ('dc:', 'http://purl.org/dc/elements/1.1/'),\n",
       " ('dbpedia2:', 'http://dbpedia.org/property/'),\n",
       " ('dbpedia:', 'http://dbpedia.org/'),\n",
       " ('skos:', 'http://www.w3.org/2004/02/skos/core#')]"
      ]
     },
     "execution_count": 10,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "list_of_prefixes"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Gerando pares de questão-sparql para cada template\n",
    "\n",
    "No exemplo a seguir é gerado no máximo 10 pares por template, ou seja, haverá no máximo 50 pares de questão-sparql no total. Esses exemplos são salvos em um arquivo que foi definido como \"pairs.csv\". A geração dos pares abaixo levará alguns minutos dependendo da sua conexão com a Internet, já que a consulta é feita online utilizando o SPARQL endpoint da DBpedia."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Executando template da linha 0\n",
      "Executando template da linha 1\n",
      "Executando template da linha 2\n",
      "Executando template da linha 3\n",
      "Executando template da linha 4\n"
     ]
    }
   ],
   "source": [
    "with open(\"pairs.csv\", \"w\") as csv_file:\n",
    "    writer = csv.writer(csv_file, delimiter=\";\")\n",
    "    writer.writerow([\"question\", \"sparql\", \"template_id\"])\n",
    "    for index, template in templates.iterrows():\n",
    "        print(\"Executando template da linha %d\" % index)\n",
    "        # Realizar a busca e construção dos pares questão-sparql\n",
    "        pairs = generator.build_pairs_from_template(\n",
    "            template,\n",
    "            prefixes,\n",
    "            list_of_prefixes,\n",
    "            \"http://dbpedia.org/sparql\",\n",
    "            number_of_examples=10,\n",
    "        )\n",
    "        for pair in pairs:\n",
    "            writer.writerow([pair[\"question\"], pair[\"sparql\"], index])\n",
    "    csv_file.close()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "O arquivo contendo os pares de questão sparql pode ser carregado através do pandas."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>question</th>\n",
       "      <th>sparql</th>\n",
       "      <th>template_id</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Kosmos 634 e Kosmos 176 são produzidos por qual empresa?</td>\n",
       "      <td>SELECT DISTINCT ?uri where { dbpedia:Kosmos_634 dbpedia2:manufacturer ?uri . dbpedia:Kosmos_176 dbpedia2:manufacturer ?uri }</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Nahuel 1A e Tele-X são produzidos por qual empresa?</td>\n",
       "      <td>SELECT DISTINCT ?uri where { dbpedia:Nahuel_1A dbpedia2:manufacturer ?uri . dbpedia:Tele-X dbpedia2:manufacturer ?uri }</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Telstar 401 e JCSAT-110 são produzidos por qual empresa?</td>\n",
       "      <td>SELECT DISTINCT ?uri where { dbpedia:Telstar_401 dbpedia2:manufacturer ?uri . dbpedia:N-SAT-110 dbpedia2:manufacturer ?uri }</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Kosmos 165 e Kosmos 314 são produzidos por qual empresa?</td>\n",
       "      <td>SELECT DISTINCT ?uri where { dbpedia:Kosmos_165 dbpedia2:manufacturer ?uri . dbpedia:Kosmos_314 dbpedia2:manufacturer ?uri }</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Skynet 5A e Alphasat são produzidos por qual empresa?</td>\n",
       "      <td>SELECT DISTINCT ?uri where { dbpedia:Skynet_5A dbpedia2:manufacturer ?uri . dbpedia:Inmarsat-4A_F4 dbpedia2:manufacturer ?uri }</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>DirecTV-14 e SES-5 são produzidos por qual empresa?</td>\n",
       "      <td>SELECT DISTINCT ?uri where { dbpedia:DirecTV-14 dbpedia2:manufacturer ?uri . dbpedia:SES-5 dbpedia2:manufacturer ?uri }</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>Kosmos 76 e Kosmos 311 são produzidos por qual empresa?</td>\n",
       "      <td>SELECT DISTINCT ?uri where { dbpedia:Kosmos_76 dbpedia2:manufacturer ?uri . dbpedia:Kosmos_311 dbpedia2:manufacturer ?uri }</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>Kosmos 580 e Kosmos 265 são produzidos por qual empresa?</td>\n",
       "      <td>SELECT DISTINCT ?uri where { dbpedia:Kosmos_580 dbpedia2:manufacturer ?uri . dbpedia:Kosmos_265 dbpedia2:manufacturer ?uri }</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>Ariel 5 e COBE são produzidos por qual empresa?</td>\n",
       "      <td>SELECT DISTINCT ?uri where { dbpedia:Ariel_5 dbpedia2:manufacturer ?uri . dbpedia:Cosmic_Background_Explorer dbpedia2:manufacturer ?uri }</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>Kosmos 173 e Kosmos 311 são produzidos por qual empresa?</td>\n",
       "      <td>SELECT DISTINCT ?uri where { dbpedia:Kosmos_173 dbpedia2:manufacturer ?uri . dbpedia:Kosmos_311 dbpedia2:manufacturer ?uri }</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10</th>\n",
       "      <td>Madonna (álbum) e The English Roses são escritos por qual autor(a)?</td>\n",
       "      <td>SELECT DISTINCT ?uri where { dbpedia:Madonna_(Madonna_album) dbpedia2:writer ?uri . dbpedia:The_English_Roses dbo:author ?uri }</td>\n",
       "      <td>2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11</th>\n",
       "      <td>Italia (álbum) e Lolita, My Love são escritos por qual autor(a)?</td>\n",
       "      <td>SELECT DISTINCT ?uri where { dbpedia:Italia_(album) dbpedia2:writer ?uri . dbpedia:Lolita,_My_Love dbo:author ?uri }</td>\n",
       "      <td>2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>12</th>\n",
       "      <td>Mathlete's Feat e F Is for Family são escritos por qual autor(a)?</td>\n",
       "      <td>SELECT DISTINCT ?uri where { dbpedia:Mathlete's_Feat dbpedia2:writer ?uri . dbpedia:F_Is_for_Family dbo:author ?uri }</td>\n",
       "      <td>2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>13</th>\n",
       "      <td>E Pluribus Wiggum e F Is for Family são escritos por qual autor(a)?</td>\n",
       "      <td>SELECT DISTINCT ?uri where { dbpedia:E_Pluribus_Wiggum dbpedia2:writer ?uri . dbpedia:F_Is_for_Family dbo:author ?uri }</td>\n",
       "      <td>2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>14</th>\n",
       "      <td>Intimate and Live e Kylie: La La La são escritos por qual autor(a)?</td>\n",
       "      <td>SELECT DISTINCT ?uri where { dbpedia:Intimate_and_Live_(album) dbpedia2:writer ?uri . dbpedia:Kylie:_La_La_La dbo:author ?uri }</td>\n",
       "      <td>2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>15</th>\n",
       "      <td>Born Sinner e The 50th Law são escritos por qual autor(a)?</td>\n",
       "      <td>SELECT DISTINCT ?uri where { dbpedia:Born_Sinner dbpedia2:writer ?uri . dbpedia:The_50th_Law dbo:author ?uri }</td>\n",
       "      <td>2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>16</th>\n",
       "      <td>The Snowmen e Coupling são escritos por qual autor(a)?</td>\n",
       "      <td>SELECT DISTINCT ?uri where { dbpedia:The_Snowmen dbpedia2:writer ?uri . dbpedia:Coupling_(UK_TV_series) dbo:author ?uri }</td>\n",
       "      <td>2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>17</th>\n",
       "      <td>Coast to Coast (álbum de Westlife) e Kristina från Duvemåla são escritos por qual autor(a)?</td>\n",
       "      <td>SELECT DISTINCT ?uri where { dbpedia:Coast_to_Coast_(Westlife_album) dbpedia2:writer ?uri . dbpedia:Kristina_från_Duvemåla dbo:author ?uri }</td>\n",
       "      <td>2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>18</th>\n",
       "      <td>Simpsoncalifragilisticexpiala(Annoyed Grunt)cious e Ice Age: A Mammoth Christmas são escritos por qual autor(a)?</td>\n",
       "      <td>SELECT DISTINCT ?uri where { dbpedia:Simpsoncalifragilisticexpiala(Annoyed_Grunt)cious dbpedia2:writer ?uri . dbpedia:Ice_Age:_A_Mammoth_Christmas dbo:author ?uri }</td>\n",
       "      <td>2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>19</th>\n",
       "      <td>Uptown Special e As Incríveis Aventuras de Kavalier &amp; Clay são escritos por qual autor(a)?</td>\n",
       "      <td>SELECT DISTINCT ?uri where { dbpedia:Uptown_Special dbpedia2:writer ?uri . dbpedia:The_Amazing_Adventures_of_Kavalier_&amp;_Clay dbo:author ?uri }</td>\n",
       "      <td>2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>20</th>\n",
       "      <td>Gonzo (empresa) escreveu qual livro?</td>\n",
       "      <td>SELECT DISTINCT ?uri where { ?uri dbo:author dbpedia:Gonzo_(company) }</td>\n",
       "      <td>3</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>21</th>\n",
       "      <td>Universidade Tecnológica de Eindhoven escreveu qual livro?</td>\n",
       "      <td>SELECT DISTINCT ?uri where { ?uri dbo:author dbpedia:Eindhoven_University_of_Technology }</td>\n",
       "      <td>3</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>22</th>\n",
       "      <td>David H. Ahl escreveu qual livro?</td>\n",
       "      <td>SELECT DISTINCT ?uri where { ?uri dbo:author dbpedia:David_H._Ahl }</td>\n",
       "      <td>3</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>23</th>\n",
       "      <td>Hilary McKay escreveu qual livro?</td>\n",
       "      <td>SELECT DISTINCT ?uri where { ?uri dbo:author dbpedia:Hilary_McKay }</td>\n",
       "      <td>3</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>24</th>\n",
       "      <td>Henry Pettitt escreveu qual livro?</td>\n",
       "      <td>SELECT DISTINCT ?uri where { ?uri dbo:author dbpedia:Henry_Pettitt }</td>\n",
       "      <td>3</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>25</th>\n",
       "      <td>Jaan Kaplinski escreveu qual livro?</td>\n",
       "      <td>SELECT DISTINCT ?uri where { ?uri dbo:author dbpedia:Jaan_Kaplinski }</td>\n",
       "      <td>3</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>26</th>\n",
       "      <td>Alexandra Ripley escreveu qual livro?</td>\n",
       "      <td>SELECT DISTINCT ?uri where { ?uri dbo:author dbpedia:Alexandra_Ripley }</td>\n",
       "      <td>3</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>27</th>\n",
       "      <td>Giuseppe Arcimboldo escreveu qual livro?</td>\n",
       "      <td>SELECT DISTINCT ?uri where { ?uri dbo:author dbpedia:Giuseppe_Arcimboldo }</td>\n",
       "      <td>3</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>28</th>\n",
       "      <td>Simon Schama escreveu qual livro?</td>\n",
       "      <td>SELECT DISTINCT ?uri where { ?uri dbo:author dbpedia:Simon_Schama }</td>\n",
       "      <td>3</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>29</th>\n",
       "      <td>Lady Gaga escreveu qual livro?</td>\n",
       "      <td>SELECT DISTINCT ?uri where { ?uri dbo:author dbpedia:Lady_Gaga }</td>\n",
       "      <td>3</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>30</th>\n",
       "      <td>Francisco Xavier do Amaral pertence a qual partido político?</td>\n",
       "      <td>SELECT DISTINCT ?uri where { dbpedia:Francisco_Xavier_do_Amaral dbo:occupation ?uri }</td>\n",
       "      <td>4</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>31</th>\n",
       "      <td>Leslie Mann pertence a qual partido político?</td>\n",
       "      <td>SELECT DISTINCT ?uri where { dbpedia:Leslie_Mann dbo:occupation ?uri }</td>\n",
       "      <td>4</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>32</th>\n",
       "      <td>Michael Imperioli pertence a qual partido político?</td>\n",
       "      <td>SELECT DISTINCT ?uri where { dbpedia:Michael_Imperioli dbo:occupation ?uri }</td>\n",
       "      <td>4</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>33</th>\n",
       "      <td>Francesco Melzi pertence a qual partido político?</td>\n",
       "      <td>SELECT DISTINCT ?uri where { dbpedia:Francesco_Melzi dbo:occupation ?uri }</td>\n",
       "      <td>4</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>34</th>\n",
       "      <td>Carlos Eugenio Restrepo pertence a qual partido político?</td>\n",
       "      <td>SELECT DISTINCT ?uri where { dbpedia:Carlos_Eugenio_Restrepo dbo:occupation ?uri }</td>\n",
       "      <td>4</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>35</th>\n",
       "      <td>Carolina Márquez pertence a qual partido político?</td>\n",
       "      <td>SELECT DISTINCT ?uri where { dbpedia:Carolina_Márquez dbo:occupation ?uri }</td>\n",
       "      <td>4</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>36</th>\n",
       "      <td>Michael Rosenbaum pertence a qual partido político?</td>\n",
       "      <td>SELECT DISTINCT ?uri where { dbpedia:Michael_Rosenbaum dbo:occupation ?uri }</td>\n",
       "      <td>4</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>37</th>\n",
       "      <td>Medeiros e Albuquerque pertence a qual partido político?</td>\n",
       "      <td>SELECT DISTINCT ?uri where { dbpedia:Medeiros_e_Albuquerque dbo:occupation ?uri }</td>\n",
       "      <td>4</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>38</th>\n",
       "      <td>Dia (cantora) pertence a qual partido político?</td>\n",
       "      <td>SELECT DISTINCT ?uri where { dbpedia:Dia_(singer) dbo:occupation ?uri }</td>\n",
       "      <td>4</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>39</th>\n",
       "      <td>Nobuhiko Okamoto pertence a qual partido político?</td>\n",
       "      <td>SELECT DISTINCT ?uri where { dbpedia:Nobuhiko_Okamoto dbo:occupation ?uri }</td>\n",
       "      <td>4</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                                                                                                            question  \\\n",
       "0                                                           Kosmos 634 e Kosmos 176 são produzidos por qual empresa?   \n",
       "1                                                                Nahuel 1A e Tele-X são produzidos por qual empresa?   \n",
       "2                                                           Telstar 401 e JCSAT-110 são produzidos por qual empresa?   \n",
       "3                                                           Kosmos 165 e Kosmos 314 são produzidos por qual empresa?   \n",
       "4                                                              Skynet 5A e Alphasat são produzidos por qual empresa?   \n",
       "5                                                                DirecTV-14 e SES-5 são produzidos por qual empresa?   \n",
       "6                                                            Kosmos 76 e Kosmos 311 são produzidos por qual empresa?   \n",
       "7                                                           Kosmos 580 e Kosmos 265 são produzidos por qual empresa?   \n",
       "8                                                                    Ariel 5 e COBE são produzidos por qual empresa?   \n",
       "9                                                           Kosmos 173 e Kosmos 311 são produzidos por qual empresa?   \n",
       "10                                               Madonna (álbum) e The English Roses são escritos por qual autor(a)?   \n",
       "11                                                  Italia (álbum) e Lolita, My Love são escritos por qual autor(a)?   \n",
       "12                                                 Mathlete's Feat e F Is for Family são escritos por qual autor(a)?   \n",
       "13                                               E Pluribus Wiggum e F Is for Family são escritos por qual autor(a)?   \n",
       "14                                               Intimate and Live e Kylie: La La La são escritos por qual autor(a)?   \n",
       "15                                                        Born Sinner e The 50th Law são escritos por qual autor(a)?   \n",
       "16                                                            The Snowmen e Coupling são escritos por qual autor(a)?   \n",
       "17                       Coast to Coast (álbum de Westlife) e Kristina från Duvemåla são escritos por qual autor(a)?   \n",
       "18  Simpsoncalifragilisticexpiala(Annoyed Grunt)cious e Ice Age: A Mammoth Christmas são escritos por qual autor(a)?   \n",
       "19                        Uptown Special e As Incríveis Aventuras de Kavalier & Clay são escritos por qual autor(a)?   \n",
       "20                                                                              Gonzo (empresa) escreveu qual livro?   \n",
       "21                                                        Universidade Tecnológica de Eindhoven escreveu qual livro?   \n",
       "22                                                                                 David H. Ahl escreveu qual livro?   \n",
       "23                                                                                 Hilary McKay escreveu qual livro?   \n",
       "24                                                                                Henry Pettitt escreveu qual livro?   \n",
       "25                                                                               Jaan Kaplinski escreveu qual livro?   \n",
       "26                                                                             Alexandra Ripley escreveu qual livro?   \n",
       "27                                                                          Giuseppe Arcimboldo escreveu qual livro?   \n",
       "28                                                                                 Simon Schama escreveu qual livro?   \n",
       "29                                                                                    Lady Gaga escreveu qual livro?   \n",
       "30                                                      Francisco Xavier do Amaral pertence a qual partido político?   \n",
       "31                                                                     Leslie Mann pertence a qual partido político?   \n",
       "32                                                               Michael Imperioli pertence a qual partido político?   \n",
       "33                                                                 Francesco Melzi pertence a qual partido político?   \n",
       "34                                                         Carlos Eugenio Restrepo pertence a qual partido político?   \n",
       "35                                                                Carolina Márquez pertence a qual partido político?   \n",
       "36                                                               Michael Rosenbaum pertence a qual partido político?   \n",
       "37                                                          Medeiros e Albuquerque pertence a qual partido político?   \n",
       "38                                                                   Dia (cantora) pertence a qual partido político?   \n",
       "39                                                                Nobuhiko Okamoto pertence a qual partido político?   \n",
       "\n",
       "                                                                                                                                                                  sparql  \\\n",
       "0                                           SELECT DISTINCT ?uri where { dbpedia:Kosmos_634 dbpedia2:manufacturer ?uri . dbpedia:Kosmos_176 dbpedia2:manufacturer ?uri }   \n",
       "1                                                SELECT DISTINCT ?uri where { dbpedia:Nahuel_1A dbpedia2:manufacturer ?uri . dbpedia:Tele-X dbpedia2:manufacturer ?uri }   \n",
       "2                                           SELECT DISTINCT ?uri where { dbpedia:Telstar_401 dbpedia2:manufacturer ?uri . dbpedia:N-SAT-110 dbpedia2:manufacturer ?uri }   \n",
       "3                                           SELECT DISTINCT ?uri where { dbpedia:Kosmos_165 dbpedia2:manufacturer ?uri . dbpedia:Kosmos_314 dbpedia2:manufacturer ?uri }   \n",
       "4                                        SELECT DISTINCT ?uri where { dbpedia:Skynet_5A dbpedia2:manufacturer ?uri . dbpedia:Inmarsat-4A_F4 dbpedia2:manufacturer ?uri }   \n",
       "5                                                SELECT DISTINCT ?uri where { dbpedia:DirecTV-14 dbpedia2:manufacturer ?uri . dbpedia:SES-5 dbpedia2:manufacturer ?uri }   \n",
       "6                                            SELECT DISTINCT ?uri where { dbpedia:Kosmos_76 dbpedia2:manufacturer ?uri . dbpedia:Kosmos_311 dbpedia2:manufacturer ?uri }   \n",
       "7                                           SELECT DISTINCT ?uri where { dbpedia:Kosmos_580 dbpedia2:manufacturer ?uri . dbpedia:Kosmos_265 dbpedia2:manufacturer ?uri }   \n",
       "8                              SELECT DISTINCT ?uri where { dbpedia:Ariel_5 dbpedia2:manufacturer ?uri . dbpedia:Cosmic_Background_Explorer dbpedia2:manufacturer ?uri }   \n",
       "9                                           SELECT DISTINCT ?uri where { dbpedia:Kosmos_173 dbpedia2:manufacturer ?uri . dbpedia:Kosmos_311 dbpedia2:manufacturer ?uri }   \n",
       "10                                       SELECT DISTINCT ?uri where { dbpedia:Madonna_(Madonna_album) dbpedia2:writer ?uri . dbpedia:The_English_Roses dbo:author ?uri }   \n",
       "11                                                  SELECT DISTINCT ?uri where { dbpedia:Italia_(album) dbpedia2:writer ?uri . dbpedia:Lolita,_My_Love dbo:author ?uri }   \n",
       "12                                                 SELECT DISTINCT ?uri where { dbpedia:Mathlete's_Feat dbpedia2:writer ?uri . dbpedia:F_Is_for_Family dbo:author ?uri }   \n",
       "13                                               SELECT DISTINCT ?uri where { dbpedia:E_Pluribus_Wiggum dbpedia2:writer ?uri . dbpedia:F_Is_for_Family dbo:author ?uri }   \n",
       "14                                       SELECT DISTINCT ?uri where { dbpedia:Intimate_and_Live_(album) dbpedia2:writer ?uri . dbpedia:Kylie:_La_La_La dbo:author ?uri }   \n",
       "15                                                        SELECT DISTINCT ?uri where { dbpedia:Born_Sinner dbpedia2:writer ?uri . dbpedia:The_50th_Law dbo:author ?uri }   \n",
       "16                                             SELECT DISTINCT ?uri where { dbpedia:The_Snowmen dbpedia2:writer ?uri . dbpedia:Coupling_(UK_TV_series) dbo:author ?uri }   \n",
       "17                          SELECT DISTINCT ?uri where { dbpedia:Coast_to_Coast_(Westlife_album) dbpedia2:writer ?uri . dbpedia:Kristina_från_Duvemåla dbo:author ?uri }   \n",
       "18  SELECT DISTINCT ?uri where { dbpedia:Simpsoncalifragilisticexpiala(Annoyed_Grunt)cious dbpedia2:writer ?uri . dbpedia:Ice_Age:_A_Mammoth_Christmas dbo:author ?uri }   \n",
       "19                        SELECT DISTINCT ?uri where { dbpedia:Uptown_Special dbpedia2:writer ?uri . dbpedia:The_Amazing_Adventures_of_Kavalier_&_Clay dbo:author ?uri }   \n",
       "20                                                                                                SELECT DISTINCT ?uri where { ?uri dbo:author dbpedia:Gonzo_(company) }   \n",
       "21                                                                             SELECT DISTINCT ?uri where { ?uri dbo:author dbpedia:Eindhoven_University_of_Technology }   \n",
       "22                                                                                                   SELECT DISTINCT ?uri where { ?uri dbo:author dbpedia:David_H._Ahl }   \n",
       "23                                                                                                   SELECT DISTINCT ?uri where { ?uri dbo:author dbpedia:Hilary_McKay }   \n",
       "24                                                                                                  SELECT DISTINCT ?uri where { ?uri dbo:author dbpedia:Henry_Pettitt }   \n",
       "25                                                                                                 SELECT DISTINCT ?uri where { ?uri dbo:author dbpedia:Jaan_Kaplinski }   \n",
       "26                                                                                               SELECT DISTINCT ?uri where { ?uri dbo:author dbpedia:Alexandra_Ripley }   \n",
       "27                                                                                            SELECT DISTINCT ?uri where { ?uri dbo:author dbpedia:Giuseppe_Arcimboldo }   \n",
       "28                                                                                                   SELECT DISTINCT ?uri where { ?uri dbo:author dbpedia:Simon_Schama }   \n",
       "29                                                                                                      SELECT DISTINCT ?uri where { ?uri dbo:author dbpedia:Lady_Gaga }   \n",
       "30                                                                                 SELECT DISTINCT ?uri where { dbpedia:Francisco_Xavier_do_Amaral dbo:occupation ?uri }   \n",
       "31                                                                                                SELECT DISTINCT ?uri where { dbpedia:Leslie_Mann dbo:occupation ?uri }   \n",
       "32                                                                                          SELECT DISTINCT ?uri where { dbpedia:Michael_Imperioli dbo:occupation ?uri }   \n",
       "33                                                                                            SELECT DISTINCT ?uri where { dbpedia:Francesco_Melzi dbo:occupation ?uri }   \n",
       "34                                                                                    SELECT DISTINCT ?uri where { dbpedia:Carlos_Eugenio_Restrepo dbo:occupation ?uri }   \n",
       "35                                                                                           SELECT DISTINCT ?uri where { dbpedia:Carolina_Márquez dbo:occupation ?uri }   \n",
       "36                                                                                          SELECT DISTINCT ?uri where { dbpedia:Michael_Rosenbaum dbo:occupation ?uri }   \n",
       "37                                                                                     SELECT DISTINCT ?uri where { dbpedia:Medeiros_e_Albuquerque dbo:occupation ?uri }   \n",
       "38                                                                                               SELECT DISTINCT ?uri where { dbpedia:Dia_(singer) dbo:occupation ?uri }   \n",
       "39                                                                                           SELECT DISTINCT ?uri where { dbpedia:Nobuhiko_Okamoto dbo:occupation ?uri }   \n",
       "\n",
       "    template_id  \n",
       "0             0  \n",
       "1             0  \n",
       "2             0  \n",
       "3             0  \n",
       "4             0  \n",
       "5             0  \n",
       "6             0  \n",
       "7             0  \n",
       "8             0  \n",
       "9             0  \n",
       "10            2  \n",
       "11            2  \n",
       "12            2  \n",
       "13            2  \n",
       "14            2  \n",
       "15            2  \n",
       "16            2  \n",
       "17            2  \n",
       "18            2  \n",
       "19            2  \n",
       "20            3  \n",
       "21            3  \n",
       "22            3  \n",
       "23            3  \n",
       "24            3  \n",
       "25            3  \n",
       "26            3  \n",
       "27            3  \n",
       "28            3  \n",
       "29            3  \n",
       "30            4  \n",
       "31            4  \n",
       "32            4  \n",
       "33            4  \n",
       "34            4  \n",
       "35            4  \n",
       "36            4  \n",
       "37            4  \n",
       "38            4  \n",
       "39            4  "
      ]
     },
     "execution_count": 12,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "pairs = pd.read_csv(\"pairs.csv\", sep=\";\")\n",
    "pairs"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.7.3"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
